## 🏗️ Azure Terraform Plan - dev

```terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg]
azurerm_container_registry.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.ContainerRegistry/registries/databrodevacr]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.OperationalInsights/workspaces/databro-dev-logs]
azurerm_storage_account.app_data: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.Storage/storageAccounts/databrodevst]
azurerm_container_app_environment.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/managedEnvironments/databro-dev-env]
azurerm_container_app.api_gateway: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/api-gateway]
azurerm_container_app.llm_service: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/llm-service]
azurerm_storage_container.public_audio: Refreshing state... [id=https://databrodevst.blob.core.windows.net/public-audio]
azurerm_storage_container.rag_state: Refreshing state... [id=https://databrodevst.blob.core.windows.net/rag-state]
azurerm_container_app.speech_service: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/speech-service]
azurerm_container_app.rag_service: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/rag-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app.api_gateway will be updated in-place
  ~ resource "azurerm_container_app" "api_gateway" {
        id                            = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/api-gateway"
        name                          = "api-gateway"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ registry {
          ~ password_secret_name = "databrodevacrazurecrio-databrodevacr" -> "acr-password"
            # (3 unchanged attributes hidden)
        }

      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ cpu               = 0.5 -> 1
              ~ image             = "databrodevacr.azurecr.io/api-gateway:c905ab077064c4f1300ce4ce9ac2507771d4729f" -> "databrodevacr.azurecr.io/api-gateway:latest"
              ~ memory            = "1Gi" -> "2.0Gi"
                name              = "api-gateway"
                # (3 unchanged attributes hidden)

              + env {
                  + name  = "COSMOS_ENDPOINT"
                  + value = (known after apply)
                }
              + env {
                  + name        = "COSMOS_KEY"
                  + secret_name = "cosmos-key"
                }
              + env {
                  + name  = "COSMOS_DATABASE"
                  + value = "databro-db"
                }
              + env {
                  + name  = "COSMOS_CONTAINER"
                  + value = "visitors"
                }

              + liveness_probe {
                  + failure_count_threshold = 3
                  + initial_delay           = 1
                  + interval_seconds        = 10
                  + path                    = "/health"
                  + port                    = 80
                  + timeout                 = 5
                  + transport               = "HTTP"

                  + header {
                      + name  = "Custom-Header"
                      + value = "Awesome"
                    }
                }

              + startup_probe {
                  + failure_count_threshold = 10
                  + interval_seconds        = 5
                  + path                    = "/health"
                  + port                    = 80
                  + timeout                 = 5
                  + transport               = "HTTP"

                  + header {
                      + name  = "Custom-Header"
                      + value = "Awesome"
                    }
                }

                # (3 unchanged blocks hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # azurerm_container_app.llm_service will be updated in-place
  ~ resource "azurerm_container_app" "llm_service" {
        id                            = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/llm-service"
        name                          = "llm-service"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "databrodevacr.azurecr.io/llm-service:918958934a3b8b22b37c54f6176e1eb137b5753b" -> "databrodevacr.azurecr.io/llm-service:latest"
              ~ memory            = "4Gi" -> "4.0Gi"
                name              = "ollama"
                # (4 unchanged attributes hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app.rag_service will be updated in-place
  ~ resource "azurerm_container_app" "rag_service" {
        id                            = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/rag-service"
        name                          = "rag-service"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ ingress {
          ~ external_enabled           = true -> false
            # (5 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ registry {
          ~ password_secret_name = "databrodevacrazurecrio-databrodevacr" -> "acr-password"
            # (3 unchanged attributes hidden)
        }

      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "databrodevacr.azurecr.io/rag-service:6fc2f19c44befaf17dfd5480a252ad7ad29e60bd" -> "databrodevacr.azurecr.io/rag-service:latest"
              ~ memory            = "2Gi" -> "2.0Gi"
                name              = "rag-service"
                # (4 unchanged attributes hidden)

                # (2 unchanged blocks hidden)
            }
        }
    }

  # azurerm_container_app.speech_service will be updated in-place
  ~ resource "azurerm_container_app" "speech_service" {
        id                            = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/containerApps/speech-service"
        name                          = "speech-service"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ ingress {
          ~ external_enabled           = true -> false
            # (5 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ registry {
          ~ password_secret_name = "databrodevacrazurecrio-databrodevacr" -> "acr-password"
            # (3 unchanged attributes hidden)
        }

      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "databrodevacr.azurecr.io/speech-service:159b997cd5a9459895ab8dee1407e447dd2c6f3d" -> "databrodevacr.azurecr.io/speech-service:latest"
              ~ memory            = "2Gi" -> "2.0Gi"
                name              = "speech-service"
                # (4 unchanged attributes hidden)

                # (2 unchanged blocks hidden)
            }
        }
    }

  # azurerm_cosmosdb_account.main will be created
  + resource "azurerm_cosmosdb_account" "main" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = (known after apply)
      + burst_capacity_enabled                       = false
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = (known after apply)
      + enable_free_tier                             = (known after apply)
      + enable_multiple_write_locations              = (known after apply)
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = true
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "eastus"
      + minimal_tls_version                          = (known after apply)
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = (known after apply)
      + name                                         = "databro-dev-cosmos"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "databro-dev-rg"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup (known after apply)

      + capabilities (known after apply)

      + capacity (known after apply)

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "eastus"
          + zone_redundant    = false
        }
    }

  # azurerm_cosmosdb_sql_container.visitors will be created
  + resource "azurerm_cosmosdb_sql_container" "visitors" {
      + account_name        = "databro-dev-cosmos"
      + database_name       = "databro-db"
      + id                  = (known after apply)
      + name                = "visitors"
      + partition_key_kind  = "Hash"
      + partition_key_path  = (known after apply)
      + partition_key_paths = [
          + "/id",
        ]
      + resource_group_name = "databro-dev-rg"
      + throughput          = 400

      + conflict_resolution_policy (known after apply)

      + indexing_policy (known after apply)
    }

  # azurerm_cosmosdb_sql_database.main will be created
  + resource "azurerm_cosmosdb_sql_database" "main" {
      + account_name        = "databro-dev-cosmos"
      + id                  = (known after apply)
      + name                = "databro-db"
      + resource_group_name = "databro-dev-rg"
      + throughput          = (known after apply)
    }

Plan: 3 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

**Plan Status**: success
**Validation**: success
**Format**: failure